# DataFrames I

- A 2d table consisting of rows and columns
- `NaN` are for missing values
- `hasnans` attribute exists only on series. `columns` exists onli on a dataframe
- `info` method returns a summary of the pandas object

In [1]:
import pandas as pd

In [6]:
# Load datasets
nba_df = pd.read_csv("nba.csv")

pandas.core.series.Series

In [7]:
s = pd.Series([1,2,3,4,5])

In [10]:
print(s.index, nba_df.index)

RangeIndex(start=0, stop=5, step=1) RangeIndex(start=0, stop=592, step=1)

In [14]:
# we can see dfs are 2 dimensional arrays
nba_df.values

array([['Saddiq Bey', 'Atlanta Hawks', 'F', ..., 215.0, 'Villanova',
        4556983.0],
       ['Bogdan Bogdanovic', 'Atlanta Hawks', 'G', ..., 225.0,
        'Fenerbahce', 18700000.0],
       ['Kobe Bufkin', 'Atlanta Hawks', 'G', ..., 195.0, 'Michigan',
        4094244.0],
       ...,
       ['Tristan Vukcevic', 'Washington Wizards', 'F', ..., 220.0,
        'Real Madrid', nan],
       ['Delon Wright', 'Washington Wizards', 'G', ..., 185.0, 'Utah',
        8195122.0],
       [nan, nan, nan, ..., nan, nan, nan]], shape=(592, 7), dtype=object)

In [15]:
s.shape

(5,)

In [16]:
nba_df.shape

(592, 7)

In [17]:
s.dtypes

dtype('int64')

In [19]:
nba_df.dtypes

Name         object
Team         object
Position     object
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [20]:
s.hasnans

False

In [33]:
nba_df['Salary'].hasnans

True

In [24]:
nba_df.columns

Index(['Name', 'Team', 'Position', 'Height', 'Weight', 'College', 'Salary'], dtype='object')

In [34]:
nba_df.axes

[RangeIndex(start=0, stop=592, step=1),
 Index(['Name', 'Team', 'Position', 'Height', 'Weight', 'College', 'Salary'], dtype='object')]

In [27]:
nba_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 592 entries, 0 to 591
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      591 non-null    object
 1   Team      591 non-null    object
 2   Position  584 non-null    object
 3   Height    585 non-null    object
 4   Weight    584 non-null    float64
 5   College   578 non-null    object
 6   Salary    488 non-null    float64
dtypes: float64(2), object(5)
memory usage: 32.5+ KB

## Differences between Shared Methods

In [39]:
revenue_df = pd.read_csv("revenue.csv", index_col="Date")
revenue_df

         New York  Los Angeles  Miami
Date
1/1/26        985          122    499
1/2/26        738          788    534
1/3/26         14           20    933
1/4/26        730          904    885
1/5/26        114           71    253
1/6/26        936          502    497
1/7/26        123          996    115
1/8/26        935          492    886
1/9/26        846          954    823
1/10/26        54          285    216

In [41]:
revenue_df.sum() # gives sums per columns

New York       5475
Los Angeles    5134
Miami          5641
dtype: int64

In [42]:
revenue_df.sum(axis="index") # traverse index and add

New York       5475
Los Angeles    5134
Miami          5641
dtype: int64

In [43]:
revenue_df.sum(axis="columns") # traverse the columns and add that up per index

Date
1/1/26     1606
1/2/26     2060
1/3/26      967
1/4/26     2519
1/5/26      438
1/6/26     1935
1/7/26     1234
1/8/26     2313
1/9/26     2623
1/10/26     555
dtype: int64

In [45]:
revenue_df.sum(axis="columns").sum()

np.int64(16250)

## Select One Column from a DataFrame
- Columns out of the data frame are series
- Series pulled out is a view of the df

In [46]:
nba_df.Team

0           Atlanta Hawks
1           Atlanta Hawks
2           Atlanta Hawks
3           Atlanta Hawks
4           Atlanta Hawks
              ...
587    Washington Wizards
588    Washington Wizards
589    Washington Wizards
590    Washington Wizards
591                   NaN
Name: Team, Length: 592, dtype: object

In [47]:
nba_df.Salary

0       4556983.0
1      18700000.0
2       4094244.0
3      20616000.0
4       2581522.0
          ...
587     1719864.0
588    10250000.0
589           NaN
590     8195122.0
591           NaN
Name: Salary, Length: 592, dtype: float64

In [48]:
nba_df["Name"]

0             Saddiq Bey
1      Bogdan Bogdanovic
2            Kobe Bufkin
3           Clint Capela
4         Bruno Fernando
             ...
587         Ryan Rollins
588        Landry Shamet
589     Tristan Vukcevic
590         Delon Wright
591                  NaN
Name: Name, Length: 592, dtype: object

## Select Multiple Columns from a DataFrame
- When passing a list of column names to the accessor of a dataframe a df is returned
- This df is a copy and not a view which is weird and different behavior to the series/column extraction

In [49]:
nba_df[["Name", "Team"]] # Returns back dataframe and this is a copy and not a view

                  Name                Team
0           Saddiq Bey       Atlanta Hawks
1    Bogdan Bogdanovic       Atlanta Hawks
2          Kobe Bufkin       Atlanta Hawks
3         Clint Capela       Atlanta Hawks
4       Bruno Fernando       Atlanta Hawks
..                 ...                 ...
587       Ryan Rollins  Washington Wizards
588      Landry Shamet  Washington Wizards
589   Tristan Vukcevic  Washington Wizards
590       Delon Wright  Washington Wizards
591                NaN                 NaN

[592 rows x 2 columns]